# DataFrame
数据帧(DataFrame)是二维数据结构，即数据以行和列的表格方式排列。

In [1]:
#引入模块
import pandas as pd
import numpy as np

In [2]:
df01 = pd.DataFrame()
print(df01)

Empty DataFrame
Columns: []
Index: []

In [4]:
#通过二维数组创建
arr = np.array([
    ['joe',70],
    ['suan',80],
    ['black',90]
])
df02 = pd.DataFrame(arr)
#自定义索引
# df02 = pd.DataFrame(arr,index = ['one','two','three'],columns = ['name','score'])
df02

       0   1
0    joe  70
1   suan  80
2  black  90

In [5]:
#通过字典创建
dict = {
    'name':['joe','susan','black'],
    'age':[19,19,20],
    'sex':['men','women','men'],
    'classid':1
}
df03 = pd.DataFrame(dict,index = ['one','two','three'])
print(df03)
# print(df03.columns)
# print(df03.index)

        name  age    sex  classid
one      joe   19    men        1
two    susan   19  women        1
three  black   20    men        1

In [14]:
#列选择
# df03.name
df03['name']['one']
df03['name']

one        joe
two      susan
three    black
Name: name, dtype: object

In [10]:
#列增加
df03['address']='上海'
df03

        name  age    sex  classid address
one      joe   19    men        1      上海
two    susan   19  women        1      上海
three  black   20    men        1      上海

In [41]:
#列删除
# del(df03['address'])
df03.pop('address')
df03

       age  classid   name    sex
one     19        1    joe    men
two     19        1  susan  women
three   20        1  black    men

In [51]:
#行选择
df03.ix['one']
# df03.loc['one']
# df03.ix['one','name']

age         19
classid      1
name       joe
sex        men
Name: one, dtype: object

In [49]:
#行增加
df03.ix['four'] = [12,1,'jack','men']
df03

      age  classid   name    sex
one    19        1    joe    men
two    19        1  susan  women
three  20        1  black    men
four   12        1   jack    men

In [53]:
#行修改
df03.ix['four'] = [15,1,'jacks','men']
df03

      age  classid   name    sex
one    19        1    joe    men
two    19        1  susan  women
three  20        1  black    men
four   15        1  jacks    men

In [55]:
#行删除
df03=df03.drop('four')
df03

      age  classid   name    sex
one    19        1    joe    men
two    19        1  susan  women
three  20        1  black    men